import React from 'react';
import { FontLoader } from '../../../../frontend/utils/src/index';
import './index.less';

export default () => {
  const [logs, setLogs] = React.useState<{msg: string, time: number}[]>([]);
  const [loaded, setLoaded] = React.useState(false);
  let startTime = Date.now();

  // 记录日志
  const printLog = (msg, showTime = true) => {
    setLogs((logs) => [...logs, { msg, time: showTime ? Date.now() - startTime : 0 }]);
  };

  const handleClick = () => {
    if (loaded) {
      setLoaded(false);
    } else {
      startTime = Date.now();
      printLog('开始加载字体', false);
      new FontLoader({
        // 字体文件放置在demo/web/public/fonts下，可以改成自定义的在线字体地址
        fontSrc: window.location.origin + '/fonts/RareWordsFonts.ttf',
        fontName: 'rare-words-font',
        onSuccess: () => {
          setLoaded(true);
          printLog('字体加载完成');
        },
        onError: (err) => {
          printLog('字体加载失败 - ' + err.message, false);
        },
      });
    }
  };

  return (
    <div className="container display">
      <p className="title">{loaded ? '已经' : '没有'}加载字体的模块</p>
      <p className={`text ${loaded ? '' : 'old'}`}>
      𮧵 𬀩 𤩽 㑇 𣲗 𰵞 𠇔 冄 䒟 𡛓 𡝗 𪻐 𫰡 䴖 𠅤 𪨧 𰎝 𫰍 㺭 𬳳 𫍽 禤 𮣳 晔 堃 䜣 𬴂 𰤕 𬍤 𪲔 𬱵 𪿖 𨭉 𰾫 㛠 𫗇 𱃚 㐵 𬬬 𫢒 𫢸 𱎞 㑳 𠊟 㮾 𣑮 𱣉  𡌶 𱮺 𪛞 𬱟 𫞦 㐱 𫖮 𫖯 
      𲊿 𱪿 䓫 燚 𬎆 𮭦 䴙 䴔 䝼 𩇕 𬘬 𰵧 𰬫 𬀪 㶥 㶲 㷧 𤎌 𪸕 𬊈 𬊤 𫞡 𤆵 𫟹 𥖄 𨱇 𡵓 竑 䫺 珣 焜 𤨾 㛇 琤 玥 旻 䳟 𬭣 璟 𨪪 𤧞 垚 𫘧 㭎 㧏 𨓈 煇 㧑 彧 𨰻 𤰉 𤰙 䶮 𠡠 𫝫 
      㙟 𰵝 䄻 𤧟 䁎 㚢 𫔭 𬮿 㢨 𫘛 𤆬 𪨰 𪜔 𫔀 樑 𬴀 𬍛 𬤐 𱯍 𬮤 𬮦 𬭚 䵍 䴓 𣛮 𢒉 𬬺 𬞟 㛃 𬍡 𱔐 𪠽 㗊 㞧 㞭 𡷫 𫵷 𬱖 𰎠 𪨶 𪩘 𬍑 𫵳 𡹇 𰎐 𡸃 㳇 𣲘 𬜬 𬇕 𬇙 𰛥 𬇹 㳠 𬈜 𤊟 𰞔 
      𬊍 䦷 䦶 㻌 𫲦 㻑 㻴 㻿 𨱎 𨱑 𰽚 𬬱 𬬲 𱂐 𰽥 𰽦 𲇷 𬬸 𬬿 𬭎 𲊿 𲂎 𡌴 𰙕 㩳 㧟 㤘 㥮 㘎 㘚 𠃌 𠂇 䓖 㧐 䥇 䙡 䁖 䅟 䴘 䴗 䦃 䥽 䱷 䦟 䦛 䏝 䲠 䲣 䲟 𤇾 䴕 䲢 𠅀 
      𠂔 𠁣 𠁭 𠀐 𠇁 𠆧 𠆫 𠅯 𠎄 𠋈 𠋄 𠋆 𠉏 𠉍 𠈗 𠇷 𠇟 𠇆 𠏋 𠎠 𠎉 𠘱 𠘳 𠘖 𠘰 𠘎 𠗚 𠘂 𠖓 𠗕 𠊰 𠊙 𠉛 𠒼 𠓙 𠑰 𠒒 𠑐 𠪙 𠙦 𠭦 𠝳 𠔼 𠻨 𠔑 𠔳 𠓾 𠣉 𠢃 𠡇 𠞭 𠳤 𠳇 𠯦 𠯫 𠯆 𠳿 𠴇 𠳼 𠳭 𠰑 
      𠰚 𠧚 𠣖 𠤏 𠮵 𠲍 𠰻 𠰼 𠰧 𠰮 𠵖 𠵕 𠷶 𠷺 𠷨 𠷯 𠶗 𠵻 𠵼 𠲮 𠴢 𠴱 𠷥 𠷋 𠷁 𠷈 𠸂 𠺕 𠺋 𠹔 𠹖 𠹌 𠸍 𠸸 𠸄 𡊼 𡊟 𡊵 𡊔 𡊛 𡊍 𡉺 𡉼 𡉁 𡉀 𡇷 𡄻 𡁠 𡂠 𡀂 𡀃 𠿟 𠻤 𠻜 𠻞 𠺝 𠺖 𠺗 𡓕 𡑭 𡒇 𡐋 𡐤 𡘪 
      𡚌 𡏛 𡏒 𡏅 𡎆 𡌼 𡍆 𡌭 𡋭 𡋯 𡋣 𡛈 𡛥 𡛙 𡛅 𡚽 𡚸 𡚳 𡚴 𡗩 𡖞 𡕷 𫫌 𭇻 𫭗 𪠋 𪠸 𪠵 𪣯 𫭾 𫭴 𪣕 𦏷 𪢲 𪥢 𫮪 𪤖 𪣹 𫱭 𫱡 𫱛 𪦈 𪦀 𫰯 𫰭 𫰤 𦫚 𪥳 𫰞 𫰝 𭖂 𪧷 𫲘 𪦬 𫲊 𪦫 𫲇 𫱵 𫵻 𪨯 𭖑 𡜱 𡜬 𡜦 
      𡛺 𡝚 𡝐 𡛰 𡛯 𡛮 𡞻 𡞹 𬁎 𡠀 𡟾 𡡡 𡡠 𡡒 𡡑 𡟇 𡟄 𡜾 𡜲 𪰕 𡞫 𡞙 𡞇 𡞀 𡟥 𡟟 𡟚 𡟊 𡝍 𪰡 𡝆 𡝃 𡢾 𡢨 𡢒 𬃧 𡢄 𬃡 𬃠 𡤕 𡣺 𪲀 𡱌 𬃟 𬃝 𡫀 𬃆 𡩯 𡠧 𬂫 𡠤 𪲉 𪲇 𡡶 𡡬 𡡥 𡣮 𪱻 𡣝 𡣗 𡣈 
      𡢿 𪲖 𡠭 𬈂 𡵖 𪶐 𡳞 𡱝 𡱘 𡸔 𡸌 𡷰 𡷥 𡷗 𡷖 𪵬 𡥘 𪵘 𬆿 𡤭 𡤜 𬆭 𡤙 𡶏 𬄿 𭬎 𡵻 𪳶 𡵬 𡵚 𪸙 𬉼 𪸒 𪸑 𡸮 𪸀 𪷸 𢁂 𪷱 𡾱 𡽜 𡽌 𡽂 𡷑 𡷎 𪷖 𡶵 𬈳 𬈲 𡶑 𡶐 𪶹 𬈠 𡺨 𡺠 𪶦 𡺑 𡺍 𡺀 𡹾 𡹬 𪹊 𢄈 𪹁 
      𪸼 𢃡 𬊝 𢃇 𢂔 𢁾 𪸵 𪸴 𬊑 𡼪 𬊌 𡻯 𬊋 𡺸 𪸫 𡺯 𡺭 𪸥 𪸞 𪸛 𬊱 𪹏 𫵿 𪩚 𪩉 𪩂 𫷋 𪫍 𪫋 𫶣 𪫧 𪭤 𫼚 𫼖 𫻑 𫷷 𪪎 𪬃 𪫹 𪫷 𪫮 𪭶 𫼯 𪯢 𫾪 𪮾 𪰌 𢬶 𢬢 𢬐 𢫓 𢪧 𢳀 𢲡 𢱍 𢱈 𢩱 𢸔 𢾑 𣅮 𣅡 𣅟 𣄿 𬒔 
      𢸍 𢷪 𢶉 𢳧 𢾄 𢼣 𢰸 𢰲 𣇋 𣆳 𫁪 𣆲 𣆟 𣉥 𣎅 𣍾 𬓤 𮂱 𣍆 𣌸 𫁵 𬔱 𬒺 𫀊 𬒮 𪿢 𣅾 𣈥 𬒙 𣈇 𣈄 𣇼 𬓉 𬘓 𣏾 𫃻 𣏪 𫃥 𬖴 𣐿 𣔌 𬖔 𣓉 𣓃 𫂕 𣌓 𫂇 𣋄 𬕅 𣎴 𫀷 𣐯 𬔴 𣐎 𣐋 𣐅 𫂡 𫅧 𫅦 𫄻 𫄷 𣔯 𬘱 𣝡 
      𣜯 𫄨 𫄧 𣚺 𬘩 𣒖 𬘨 𣑬 𬘟 𣘚 𣘎 𣗼 𣗹 𮉡 𣖮 𫈄 𣢹 𫇱 𬜦 𬜢 𬜡 𫆣 𬚟 𫆅 𢏫 𢏤 𢎪 𢎘 𢍂 𢌜 𢌚 𢋄 𬊸 𢒰 𢈚 𢈇 𢆶 𢄏 𢊯 𢉦 𢈻 𬍒 𢙇 𢙅 𢘝 𢘅 𪻛 𪻘 𢗨 𬍬 𢗦 𬍫 𢗝 𪻧 𪻦 𢖵 𢖳 𢚁 𢚀 𢕻 𢔪 𢓵 
      𢓱 𢓰 𢎎 𪹯 𢓨 𢓥 𢓕 𢓆 𪻕 𪻓 𪻎 𢖠 𢖝 𢖏 𢦤 𪻳 𢥘 𢥏 𪻱 𢤲 𪻬 𢣤 𢣐 𪼄 𢡁 𬎌 𪼕 𭹰 𢠘 𪼑 𬎅 𪼐 𢝜 𬍣 𢝆 𢝁 𢜽 𬍠 𢜱 𢜛 𪻪 𪼃 𪻿 𢛵 𪻾 𢛔 𢚢 𪻷 𬍴 𪼥 𪼤 𪼣 𬎃 𬍽 𢨮 𢧇 𢧂 𪼬 𤊻 𤊴 𤈍 𤌭 𤌧 𫐼 
      𤐶 𤏻 𤏸 𤘧 𤗜 𤔣 𫑳 𤌷 𫑡 𤌴 𫑟 𫐐 𤌙 𤋙 𤎥 𤍓 𫐣 㐷 𤣰 𬬹 㐸 㐨 𬬵 𤞶 𬬭 㐅 𤤥 𬫯 𫒩 𤥢 𤥒 𬬩 𤥇 㑎 㐾 𤣹 𬬻 𤞞 𤝲 𤛱 𤤛 𫒞 𤤌 𫒝 𤤄 𤤂 𤔅 𬬔 𫓔 𫓐 㙞 𬭝 㙍 𬭛 㙘 𤦃 𤥿 𤨖 𬭓 
      㘰 㗑 𤧶 𫓷 𤧴 𤧥 𤧛 㙦 㙩 㕊 𬭋 㕤 𤤸 鿏 㕅 𤤧 𤤦 㓦 𤥴 𤥰 𤥨 𤦬 㑲 㑗 㑚 𤦤 𤦎 㗄 𫓶 㕸 㖒 㜬 𫔻 㜊 㜣 㛾 㜁 𤨧 㛦 𬮇 㛫 𤫁 㛡 𤪼 𫔎 㛢 𬭼 𤪺 𤪤 㛚 𤪟 𤪌 㝋 㛈 
      㛉 𬭩 㛅 㛄 㚵 𤦹 㘵 㚱 㚴 㚬 𤩥 㚰 𤩢 𤩝 㚥 𤩛 𤩊 𤩄 㛓 㛖 㭠 𬱣 㬳 㭁 𤫞 㬊 𤫉 㫃 㩄 㧥 㥔 𫕻 𨛍 𫕴 𫕩 㤏 㢍 𬯼 㢀 𤩼 𫕠 㠉 𤩶 㟤 𤩲 𫕛 㟪 𤩱 𬉦 㟏 𤩭 㟖 㟍 
      𬯀 㞩 㵿 㵘 㴓 㳱 㳯 㳋 㳍 㱔 㯎 㯝 㯌 㮩 㮟 㮊 㭪 㭫 㻍 㻇 㻂 㹧 㷬 㷒 㶿 㶴 㶬 𣳤 𣳃 𣲭 𣱼 龿 𣭠 𫈒 𣴙 𣴓 𣣣 𣬂 𫉃 𬝚 𣸥 𬞸 𫉯 𣵡 𬞦 𣷿 𣻼 𣻐 𣶶 𣶏 𣶋 𬝒 𬝎 𣲒 
      𣱽 𣴥 𫉟 𣴞 𫉔 𣷫 𬢲 𫌶 𤆞 𤆃 𤄖 𬤕 𤃈 𫍲 𤁪 𫊉 𬟇 𣾜 𫋳 𣽸 𬣡 𣽛 𤂶 𬤊 𬤇 𬤁 𬨎 𫏴 𫏬 𤇕 𬦈 𥛢 𥛚 𥚷 𥚊 𥙹 𥘺 𥘮 𥜴 𥘫 𥞧 𥣳 𥣩 𥢹 𥫝 𥪀 𥟠 𮥍 𥟍 𥞚 𥞊 𥞃 𥝴 𥝦 𥝥 𥡅 𥠅 𥛷 𫣅 𥛯 𠊄 𥮤 𠋥 𬝌 
      𠉄 𥭡 𥳾 𥳕 𥳇 𥲑 𥿩 𥿝 𥾋 𥽬 𥼁 𠒣 𠓰 𥯔 𠍐 𠎶 𥮬 𥦨 𥭞 𥬯 𥬝 𥬉 𥫸 𥱤 𥯪 𥯤 𥯕 𥧓 𥧏 𡊰 𦁤 𡊤 𡊚 𠛼 𦆆 𠚵 𦅼 𠛀 𦅣 𡉦 𦏸 𡉫 𡉑 𡉥 𦌊 𦋅 𡊿 𡋎 𡊱 𡊻 𦂄 𠰉 𥵧 𠰩 𥵞 𠱐 𠡒 𦀕 𠕽 𠙶 𦅘 𠕇 𦄢 𦂕 
      𠵌 𠼟 𠳐 𡛕 𡛩 𡘧 𦑍 𦑋 𡑒 𡘙 𦑁 𡐹 𡑄 𦒘 𡏼 𦗭 𡐓 𦖽 𡏞 𦖵 𡎜 𦕠 𡏊 𦔿 𡛻 𡛼 𡍲 𦊓 𡍹 𡌢 𡌚 𦆴 𦐹 𡉽 𦐄 𡋟 𦒑 𡋗 𦒍 𡋙 𦑹 𡋕 𦑡 𦑠 𦑝 𦑘 𡎚 𡍼 𡎑 𢆓 𡺎 𡼎 𦙮 𦙀 𡷀 𡷈 𦘪 𡶦 𡶄 𡵅 𡴭 𡥧 𦔖 𦓱 
      𡟛 𦓰 𡟯 𦓔 𡟃 𦓎 𡝹 𡜿 𡜵 𣗬 𣗁 𣒍 𣔙 𣑯 𣍏 𣊭 𣍇 𣈅 𣊐 𣁦 𣁚 𢬑 𢭪 𢠖 𢛜 𢔁 𢌷 𢈍 𣸣 𣵜 𣵛 𣳑 𣲲 𣲾 𣲥 𣭲 𣬛 𣚭 𤲞 𤱧 𤴻 𤳖 𤫫 𮪒 𥇦 𥇖 𤽈 𬊣 𥅉 𥅅 𥊧 𥉐 𫘘 𥈨 龭 𤽹 𫗧 𤰼 𬲯 𤷍 𤵐 龮 𥄟 𥕥 
      𬶐 𬶍 𥔿 𥓒 㻞 𬷕 㻢 𥐚 䃅 𥒰 䂼 𥒞 䃂 䂬 𥑸 䂭 𥑮 䀹 𥖁 𥕵 𥑇 𬴃 𥐸 𥐱 𥐯 𥐩 𥐜 𥆡 𥅽 㻚 𥏜 𬷈 㻖 㻙 㻐 𥋆 𥑘 䄸 䄓 䄙 𬸦 䃿 䉪 𡷟 䓶 䔉 䓂 䓊 䒩 䒵 䒕 㽘 㿠 㽏 
      䃥 䃎 䃗 𬸘 䇯 䇛 䇭 䅼 𥘏 䆔 𥗝 𥖏 𨑾 䝞 䕕 䖑 䔧 䔽 䵚 𫝴 𫟭 䑩 䑣 䌹 䔟 䧄 䢺 䤰 𠇱 𠆩 𠃝 䨝 䨒 𦸁 𦷪 𧁃 𧀺 𧀮 𧀠 𧄁 𧃸 𦽎 𦼊 𦺷 𦺦 𦺖 𦺓 𦺊 𦾿 𦹔 𦸗 𦸐 𦸂 𥚛 𧉟 𥚉 𧕖
      𧒽 𧎚 𧙣 𧙝 𥥧 𥥅 𧊂 𧉽 𥞍 𥤺 𧉣 𧄠 𧌊 𧊬 𧂨 𧂈 𧁜 𧛀 𦸪 𧚫 𧚨 𦊫 𧟄 𧞏 𦬎 𧦞 𦭜 𦬅 𧥣 𧣖 𧊅 𧈢 𧉀 𧛟 𧆺 𦓐 𧗠 𦖠 𧚉 𫟼 𧚀 𥸱 𧜧 𧜊 𧛭 𮃇 𦥏 𧘏 𧘍 𧨳 𨥖 𧨡 𨚗 
      𧧾 𨟠 𨓨 𧧸 𧧕 𠽠 𧙖 𧪦 𧬌 𨐒 𧬆 𨑥 𧬂 𬭤 𨈘 𧫿 𧫱 𧫥 𨦮 𠃛 𧺫 𧡤 𧻢 𧠯 𧠪 𧲧 𧠩 𧠆 𧝁 𦰡 𧧏 𦭳 𦯿 𧪚 𧪕 𧐔 𧩦 𧨿 𨈓 𧼯 𬽦 𧮞 𧭮 𧭜 𬽬 𧫤 𨿅 𧫜 𨹓 𧫕 𨻧 𧫓 𩡝 𤦵 𪢼 𪢻 𫭟 𫭝 𪢹 𪢸 𪢫 𪟝 𪞤 𫥆 
      𭖊 𪝆 𫮉 𪣤 𪣟 𪣜 𪣑 鿍 𪣉 𦤎 𦣦 𪻏 𦨴 𦨤 𦨢 𦨍 𦨉 𦙶 𦛋 𦚱 𦚧 𦚔 𦮛 𦭻 𦭶 𦭰 𦩠 𦩘 𦩏 𦩌 𦭑 𦮹 𦮶 𦮭 𦬁 𦪙 𦪑 𦢂 𦟟 𦞳 𭸷 𦝨 𦨾 𦬱 𦬪 𦬞 𦬕 𦴊 𦳫 𦳝 𤇏 𦰱 𦳌 𤓾 𦳄 𤍤 𦲶 𤉙 𦵧 𦱊 𦱅 𦱀 𦰺 𦭛 
      𦭘 𦰏 𦯬 𣺮 𦯀 𦱷 𤤗 𤤮 𭩈 𤤆 𤩠 𤩔 𤨲 𤧼 𤙔 𤘪 𤛭 𦶕 𦵼 𦵫 𤥐 𦵩 𤥁 𤈄 𤯥 𤬪 𥖜 𥖨 𥕞 𥕢 𤧣 𤧘 𤧊 𤧐 𤪑 𥐰 𥐙 𥂋 𤰚 𤱙 𥘌 𥖮 𥒫 𥓂 𥑬 𥑋 𨨅 𨧰 𨧤 𨧡 𨦫 𨹸 𨹚 𨹗 𨹑 𨹍 𨸘 𨶈 𨶇 𨱔 𨱈 𨱃 𨰣 𨰃 
      𨯚 𨯌 𨮔 𨮒 𨭐 𨸕 𨬛 𨪄 𨨖 𩂿 𪯲 𩊬 𩊂 𩔊 𬂣 𩅿 𩅄 𬀉 𩄻 𩃀 𩂴 𩂤 𩂓 𩂍 𩂄 𩇔 𩆩 𨿁 𨾉 𨼿 𩙡 𩢸 𩢷 𩢴 𬂭 𪳆 𩤥 𩤠 𩤏 𩣸 𬇨 𩚹 𩐁 𩎿 𩖣 𩖠 𩖛 𩡺 𩡕 𩠻 𩒀 𬃒 𩑻 𪲞 𩐤 𩦹 𩦠 𩻪 𬉿 𩺰 𬉾 𩵖 𩱞 𩧉 
      𩣱 𩣮 𪶽 𪵩 𩥐 𩥋 𩥉 𩤽 𪸎 𩣳 𬈷 𩣲 𬎏 𪂕 𬎇 𪂈 𬎋 𪁿 𪁏 𪼏 𪻽 𪀩 𬍺 𪻤 𩱇 𩫆 𩪛 𩨑 𬊀 𩾽 𩽾 𬋅 𬍥 𬒗 鿎 𬒈 𮀔 𪾢 𪽏 𪽇 𪼦 𬘧 𬘡 𫂺 𬕂 𬓮 𪿲 𧻚 𨀘 𧿥 𧾰 𧼨 𧯀 𧲡 𨒇 𨒃 𨄗 𨂿 𨁏 𨁂 𨓿 𧂋 𨓯 𨓞 
      𨒱 𢙿 𨒫 𨆬 𨄮 𧺸 𧺊 𨀙 𩢀 𨍶 𨋺 𨊧 𨇤 𨠏 𨟵 𨞺 𨞕 𫮑 𨗦 𫮃 𨝎 𪤊 𨜶 𨜓 𨜏 𨢌 𨡹 𨚔 𨙴 𨗴 𨗨 𨑨 𨔦 𨛴 𨛮 𨛬 𨚮 𪤗 𫰛 𪥰 𨥜 𫳑 𫱮 𫰾 𭏦 𪤏 𨝯 𨥙 𫰎 𪥈 𨥌 𨥈 𪤅 𪨪 𪥵 𡸫 𪨳 𪥼 𪭴 𭜸 𫶇 𪩃 𫓯 𬬾 
      𬭸 𬭳 𬭯 𬭄 𫓹 𬮡 𫕟 𫠃 𬯎 𬷻 𬶖 𬳽 𬴊 𫘪 𬳿 𬳶 𫘜 𫘝 𫘨 𫘦 𪝉 𫠡 𬸣 𬶌 𫛲 𬸚 𪋮 𪋬 𪋡 𪊷 𪊶 𪇵 𪆶 𪄹 𪄴 𪃾 𪃑 𪂹 𫢎 𪕀 𪒠 𪎒 𪌼 𪜳 𪈼 𫢉 𫥡 𫥞 𬙂 𬙙 𬘴 𬘭 𫢷 𬜥 𫇭 𭃂 𫢌 𬽪 𬘫 𫢝 鿇 𪝞 𪟺 𬣞 
      𫅪 𬚖 𬜯 𫥓 𫇺 𬟽 𫦪 𪟘 𫍯 𫐄 𬩽 𬢤 𬣙 𬬮 𫓧 𮞑 𬩳 𪦪 𫞩 𬍕 𤉹 牪 𢶀 𡎠 𫭽 𬟔 𫩑 𫵺 㕵 𠕆 𬈯 䭰 𫭢 䥈 𬦱 𪮅
      </p>
      <button onClick={handleClick}>{loaded ? '取消加载' : '开始加载'}生僻字字体</button>
      <p className="title">字体加载日志</p>
      <div className="logs">
        {logs.map((log, index) => (
          <p key={`log-${index}`} className="log">{`${log.msg}${log.time ? `，耗时 ${log.time} ms` : ''}`}</p>
        ))}
      </div>
    </div>
  );
};
